app/views/users/_form.html.erb

SELECT "groups".* FROM "groups"
---
      <div class="col-lg-10">
        <%= f.collection_select :group_id, Group.all, :id, :name, :class => "form-control" %>

SELECT "clients".* FROM "clients"
---
      <div class="col-lg-10">
        <%= f.collection_select :client_id, Client.all, :id, :name, :class => "form-control" %>