app/views/users/index.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]
---
            <td><%= user.client.name %></td>
            <td><%= user.group.name %></td>