app/views/users/show.html.erb

            <td><%= @user.last_name %></td>
              <td><%= @user.group.name unless @user.group == nil %></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]