app/views/records/_form.html.erb

SELECT "users".* FROM "users"
---
    <div class="col-lg-10">
      <%= f.collection_select :user_id, User.all, :id, :full_name %>

SELECT "courses".* FROM "courses"
---
    <div class="col-lg-10">
      <%= f.collection_select :course_id, Course.all, :id, :name %>