app/views/records/index.html.erb

            <td><%= record.user.client.name %></td>
            <td><%= record.user.group.name %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]