app/views/records/show.html.erb

   <dt>Group:</dt>
  <dd><%= @record.user.group.name %></dd>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]