app/controllers/clients_controller.rb

  def index
    @clients = Client.page(params[:page]).per_page(10)
---
SELECT "clients".* FROM "clients"

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 02 Oct 2013 19:25:57 UTC +00:00], ["name", "Test Client 1"], ["updated_at", Wed, 02 Oct 2013 19:25:57 UTC +00:00]]

  def update
    respond_to do |format|
      if @client.update(client_params)
---
UPDATE "clients" SET "name" = $1, "updated_at" = $2 WHERE "clients"."id" = 1  [["name", "Boots Smith Oilfield Services, LLC"], ["updated_at", Wed, 02 Oct 2013 22:45:32 UTC +00:00]]