app/controllers/courses_controller.rb

  def index
    @courses = Course.page(params[:page]).per_page(10)
---
SELECT "courses".* FROM "courses"

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("created_at", "name", "requal_interval", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 02 Oct 2013 19:26:43 UTC +00:00], ["name", "Test Course"], ["requal_interval", 12], ["updated_at", Wed, 02 Oct 2013 19:26:43 UTC +00:00]]