app/controllers/groups_controller.rb

  def index
    @groups = Group.page(params[:page]).per_page(10)
---
SELECT "groups".* FROM "groups"