app/controllers/records_controller.rb

  def index
    #raise  params.inspect
      if params.include?(:client)
        @records = User.find_by_id(params[:client][:user_id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 ORDER BY "clients"."id" ASC LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def show
    @course = Course.find(@record.course_id)
---
SELECT "courses".* FROM "courses" WHERE "courses"."record_id" = ? ORDER BY "courses"."id" ASC LIMIT 1  [[nil, 1]]

  def new
    @record = Record.new
    @clients = Client.all
    @groups = Group.all
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @record = Record.new(record_params)
    interval = set_requal(@record)
    @record.requal_date = @record.completed_date + interval.months
    respond_to do |format|
      if @record.save
---
INSERT INTO "records" ("completed_date", "course_id", "created_at", "pass", "requal_date", "score", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_record
      @record = Record.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "1"]]

    def set_requal(record)
      course = Course.find(record.course_id)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]