app/controllers/static_controller.rb

INSERT INTO "courses" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Thu, 03 Oct 2013 00:19:41 UTC +00:00], ["name", "Abrasive Blasting"], ["updated_at", Thu, 03 Oct 2013 00:19:41 UTC +00:00]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
---
	def index

		courses = ["Abrasive Blasting","Aerial Lifts","Asbestos Awareness","GFCI","Behavior Based Safety","Benzene Awareness","Bloodborne Pathogens","Confined Space / Permit Confined Space","Cranes","Disciplinary Program","Driving Safety","Electrical Safety Awareness","Fall Protection","Fatigue Management","Fire Protection / Extinguishers","First Aid","Forklift & Industrial Trucks","Gas Hazards","General Waste Management","Hand AND/OR Power Tools","Hazard Communication - (HAZCOM)","Hazard Identification & Risk Assessment","Hazardous Waste Operations / Emergency Response","Hydrogen Sulfide - H2S","In Plant Rail Safety","Incident Investigation and Reporting","Ladder Safety","Lead","Lead Awareness","Lockout / Tagout","Manual Lifting","Mobile Equipment","Natural Occurring Radioactive Material - (NORM)","Noise Awareness","Noise Exposure / Hearing Conservation","Personal Protective Equipment / Assessments - (PPE)","Respiratory Protection","Rigging Material Handling","Scaffolds","Short Service Employee (SSE)","Spill Prevention / Response","Stop Work Authority","Subcontractor Management Plan","Trenching / Shoring / Excavations","Welding, Cutting, Hot Work","Working Alone"]

		courses.each do |c|
			Course.create(:name => c)
		end

		u = User.first