app/controllers/status_report_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 ORDER BY "clients"."id" ASC LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "records".* FROM "records"
---
	def index
	    #raise  params.inspect
      if params.include?(:client)
        @records = User.find_by_id(params[:client][:user_id])
        if @records.nil?
          flash[:error] = "Please select a Company and User"
        else
          @records = @records.records.page(params[:page]).per_page(10)