app/controllers/users_controller.rb

  def new
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("client_id", "created_at", "first_name", "last_name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["client_id", 1], ["created_at", Wed, 02 Oct 2013 19:26:29 UTC +00:00], ["first_name", "Test"], ["last_name", "User"], ["updated_at", Wed, 02 Oct 2013 19:26:29 UTC +00:00]]